docs/quickstarts/writing-a-trigger.mdx

---
id: writing-a-trigger
title: Escribiendo un Desencadenador
description: Aprende cómo escribir un desencadenador para un componente personalizado examinando cómo nuestro desencadenador de Salesforce maneja las solicitudes de webhook.
---

import Screenshot from "@site/src/components/screenshot";

En este tutorial, repasaremos cómo escribimos un desencadenador para nuestro [componente de Salesforce](components/salesforce.mdx) para servir como ejemplo de cómo escribir desencadenadores para tus propios componentes personalizados.
Los [mensajes salientes](https://developer.salesforce.com/docs/atlas.en-us.api.meta/api/sforce_api_om_outboundmessaging_understanding.htm) de Salesforce te permiten enviar actualizaciones sobre cuentas de Salesforce, oportunidades y más a webhooks de tu elección.
Sin embargo, las integraciones con Salesforce no funcionan bien con el [desencadenador estándar de webhook](integration-triggers.mdx#webhook-triggers) por dos razones:

1. Los mensajes salientes de Salesforce envían cargas útiles XML en lugar de JSON.
   Esto no es un problema grave, pero todas las integraciones con Salesforce necesitarían comenzar con un paso adicional de [Deserializar XML](components/change-data-format.mdx#deserialize-xml).
   Sería conveniente si el desencadenador se encargara de la deserialización XML.
2. Los mensajes salientes de Salesforce requieren una respuesta de acuse de recibo (ACK) que tiene un [formato muy particular](https://developer.salesforce.com/docs/atlas.en-us.api.meta/api/sforce_api_om_outboundmessaging_wsdl.htm).
   El desencadenador de webhook estándar no envía esa respuesta de ACK propietaria.
   En su lugar, responde con un ID de ejecución en formato JSON.
   Dado que no recibiría su respuesta ACK propietaria, Salesforce reenviaría su mensaje saliente docenas de veces y luego informaría "fallo".
   Necesitamos un desencadenador que pueda responder a las solicitudes de Salesforce con un ACK de Salesforce.

Entonces, desarrollaremos un desencadenador de Salesforce que deserializa XML y responde con un ACK de Salesforce.

## Deserializando XML

Comencemos abordando el primer problema: deserializar XML dentro del desencadenador.
Podríamos omitir este paso, pero entonces cada integración con Salesforce requeriría un paso adicional de [Deserializar XML](components/change-data-format.mdx#deserialize-xml).
Si sabemos que podemos esperar XML de Salesforce, es más limpio encargarse de la deserialización XML como parte del desencadenador.

Usaremos [fast-xml-parser](https://www.npmjs.com/package/fast-xml-parser) para deserializar el XML, y guardaremos el objeto creado a partir de la deserialización en los datos del payload del desencadenador en `body.data`:

```typescript
import { trigger, TriggerPayload, HttpResponse, util } from "@-io/spectral";
import { parse } from "fast-xml-parser";

export const salesforceTrigger = trigger({
  display: {
    label: "Webhook",
    description:
      "Activador para gestionar las solicitudes de webhook de la plataforma Salesforce. Devuelve la respuesta esperada a Salesforce y convierte la carga útil XML en un objeto para un uso más conveniente en el resto del flujo.",
  },
  perform: async (context, payload, params) => {
    // Hacer una copia de la carga útil que recibió el disparador
    const finalPayload: TriggerPayload = { ...payload };

    const parseOptions = {
      ignoreAttributes: false,
      ignoreNameSpace: false,
      textNodeName: "_text",
    };

    // Deserializar XML a objeto JS.
    finalPayload.body.data =
      parse(util.types.toString(finalPayload.body.data), parseOptions) || {};
    delete finalPayload.body.contentType;

    // Devuelve la carga útil, con un cuerpo deserializado.
    return Promise.resolve({
      payload: finalPayload,
    });
  },
  inputs: {}, // This trigger takes no inputs
  synchronousResponseSupport: "invalid",
  scheduleSupport: "invalid",
});

export default { salesforceTrigger };
```

Concentrémonos en algunas partes de este código:

Similar a una [acción](custom-components/writing-custom-components.mdx#escribiendo-acciones), la función `perform` de un desencadenador recibe [contexto](custom-components/writing-custom-components.mdx#el-parámetro-contexto) y `params` (entradas) como parámetros (aunque este desencadenador no toma entradas). Además, recibe un parámetro `payload`, que contiene el payload (encabezados y cuerpo) de la invocación del webhook:

```typescript
perform: async (context, payload, params) => {};
```

Podemos hacer referencia al cuerpo sin procesar del payload del webhook y asegurarnos de que se convierta en una cadena utilizando la función [toString](spectral/modules/_util_.md#const-tostring) de Spectral. Luego, podemos analizar el XML en un objeto JavaScript para que sea más fácil de referenciar. Dado que estamos devolviendo un objeto deserializado, y no XML serializado, podemos eliminar `contentType` del cuerpo del payload:

```typescript
// Deserializar XML a objeto JS.
finalPayload.body.data =
  parse(util.types.toString(finalPayload.body.data), parseOptions) || {};
delete finalPayload.body.contentType;
```

Finalmente, podemos devolver un payload actualizado que pueda ser referenciado por pasos posteriores. Este payload actualizado contiene un cuerpo XML deserializado, por lo que las claves dentro del XML pueden ser fácilmente referenciadas:

```typescript
return Promise.resolve({
  payload: finalPayload,
});
```

Ahora que estamos analizando el XML que llega, podemos ver que la salida del activador de Salesforce cuando se invoca desde un mensaje saliente de Salesforce es un objeto con claves fáciles de referenciar:

<Screenshot
  filename="quickstarts/writing-a-trigger/deserialized-body.png"
  maxWidth="600px"
  alt="Integración Salidas de pasos de activación en el diseñador de integración"
/>

## Respondiendo con un mensaje de acuse de recibo

A continuación, configuremos el disparador para responder con un mensaje de acuse de recibo de Salesforce. Sin un mensaje de acuse de recibo adecuado, Salesforce intenta reenviar el mismo mensaje varias veces durante unas pocas horas.

Para hacer eso, todo lo que tenemos que hacer es agregar una `respuesta` al objeto de retorno de nuestra función `perform`. Esa `respuesta` debe ser del tipo `HttpResponse` (definida en Spectral):

```typescript {1,8-19,24}
import { HttpResponse } from "@-io/spectral";

export const salesforceTrigger = trigger({
  //...
  perform: async (context, payload, params) => {
    // ...

    // Cree la respuesta HTTP que espera Salesforce
    const response: HttpResponse = {
      statusCode: 200,
      contentType: "text/xml; charset=utf-8",
      body: `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
      <soapenv:Body>
        <notificationsResponse xmlns="http://soap.sforce.com/2005/09/outbound">
          <Ack>true</Ack>
        </notificationsResponse>
      </soapenv:Body>
      </soapenv:Envelope>`,
    };

    // Devuelve la carga útil, con un cuerpo deserializado.
    return Promise.resolve({
      payload: finalPayload,
      response,
    });
  },
});
```

Dentro de nuestro objeto `response`, indicamos que el disparador debe devolver el código de estado HTTP `200`, que estamos devolviendo XML `text/xml`, e incluye el mensaje de ACK que [Salesforce requiere](https://developer.salesforce.com/docs/atlas.en-us.api.meta/api/sforce_api_om_outboundmessaging_wsdl.htm). Cuando el bloque `return` incluye una `response`, la respuesta predeterminada del ID de ejecución es anulada por la respuesta que especificamos.

Ahora nuestro disparador está configurado para responder a Salesforce de la manera que Salesforce espera. Podemos ver esa respuesta en acción al golpear el punto final del webhook de nuestra integración:

```bash
curl -L 'https://hooks..io/trigger/EXAMPLE==' \
  --header "Content-Type: application/xml" \
  --data '
<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Body>
      <notifications xmlns="http://soap.sforce.com/2005/09/outbound">
         <OrganizationId>00D2w000ghj72NEAT</OrganizationId>
         <ActionId>04k2w0000004FdvAAE</ActionId>
         <SessionId>00D2w00000DM72N!ARsfgG0PvTV4_PFOLH7FfAf0MSc</SessionId>
         <EnterpriseUrl>https://ap16.salesforce.com/services/Soap/c/50.0/00D2w00000Dfhy2N\</EnterpriseUrl\>
         <PartnerUrl>https://ap16.salesforce.com/services/Soap/u/50.0/00D2w00000Dyh72N\</PartnerUrl\>
         <Notification>
            <Id>04l2w0000005fyhjAAI</Id>
            <sObject xmlns:sf="urn:sobject.enterprise.soap.sforce.com" xsi:type="sf:Case">
               <sf:Id>5002w00000BSfffAA1</sf:Id>
               <sf:CaseNumber>000007551</sf:CaseNumber>
               <sf:ContactEmail>test@email.com</sf:ContactEmail>
               <sf:ContactId>056632w0000fyhjntHAA3</sf:ContactId>
               <sf:ContactPhone>0999155r475</sf:ContactPhone>
               <sf:CreatedById>0052w00000fhzLcAAI</sf:CreatedById>
               <sf:CreatedDate>2020-11-23T07:36:08.000Z</sf:CreatedDate>
               <sf:IsClosed>false</sf:IsClosed>
               <sf:IsDeleted>false</sf:IsDeleted>
               <sf:IsEscalated>false</sf:IsEscalated>
               <sf:LastModifiedById>0052w0000g6likuzLcAAI</sf:LastModifiedById>
               <sf:LastModifiedDate>2020-11-23T07:37:22.000Z</sf:LastModifiedDate>
               <sf:LastReferencedDate>2020-11-23T07:37:22.000Z</sf:LastReferencedDate>
               <sf:LastViewedDate>2020-11-23T07:37:22.000Z</sf:LastViewedDate>
               <sf:Origin>Web</sf:Origin>
               <sf:OwnerId>0052w00000hlzghAI</sf:OwnerId>
               <sf:Priority>Medium</sf:Priority>
               <sf:Status>New</sf:Status>
               <sf:Subject>id check</sf:Subject>
               <sf:SystemModstamp>2020-11-23T07:37:22.000Z</sf:SystemModstamp>
            </sObject>
         </Notification>
      </notifications>
   </soapenv:Body>
</soapenv:Envelope>'


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
      <notificationsResponse xmlns="http://soap.sforce.com/2005/09/outbound">
         <Ack>true</Ack>
      </notificationsResponse>
   </soapenv:Body>
</soapenv:Envelope>
```

## Conclusión

En este tutorial cubrimos el procesamiento del payload del webhook dentro de un disparador y la modificación de la respuesta HTTP del webhook. El ejemplo utilizado fue para Salesforce, pero podría adaptarse para muchos otros sistemas de terceros. Algunos sistemas de terceros, por ejemplo, requieren que devuelvas parte del payload del webhook en la respuesta para asegurarte de que se recibió correctamente; eso podría hacerse fácilmente capturando una clave o encabezado del payload del webhook y creando un objeto `HttpResponse` que contenga esa información.

Para leer más sobre la redacción de disparadores, consulta nuestro artículo [Writing Custom Components](custom-components/writing-custom-components.mdx#writing-triggers).